#include <iostream>
using namespace std;
int main() {
	// дан масив из пяти элементов вывести масив из последнего элемента
	//const int  r = 5;
	//int mas[r];
	//for (int i = 0; i <= r; i++) {
	//}
	//for (int i = r - 1; i >= 0; i--) {
	//	for (int i = r - 1; i >= 0; i--) {
	//		cout << mas[i] << ' ';
	//	}
	//	cout << endl;


//	}
// масив из 15 элементов заполнить его случайнымип элементами из диапазона 0-20
	//int kol_vo = 0;
	//const int n = 15;
	//int arr[n];
	//for (int i = 0; i < n; i++) {
		//if (arr[i] % 2 == 0) {
			//kol_vo++;
		//}

//}

	 1 Дан массив из 15 элементов.Заполнить его случаными числами из диапазона 0 - 20. Подсчитать кол - во чисел в массиве, которые не делятся на 5
	int kol_vo = 1;
	const int n = 15;
	int arr[n];
	for (int i = 0; i < n; i++) {
		if (arr[i] % 5 != 0) {
			kol_vo++;
		}

		//2 Дан массив из 20 элементов.Заполнить его случайными числами из диапазона 0 - 30. Подсчитать сумму тех чисел в массиве, которые делятся на 3 И на 5

	//int kol_vo = 1;
	// int sum = 0;
	/	const int n = 20;
	//	int arr[n];
		//for (int i = 0; i < n; i++) {
		//	if (arr[i] = rand() % 31)
		//	cout << arr[i] << " ";
		//}
		//cout << endl;
		//for (int i = 0; i < n; i++) {
		//	if (arr[i] % 5 == 0 && arr[i] % 3 == 0)
		//		sum += arr[i];
		//}
	//cout << sum << endl;



	


}






